01_Offlines/Offline_4_Load_Testing_JMeter/JMeter-Practice/folder/report2-2305019/final_html_dashboard/statistics.json
{
  "/-1" : {
    "transaction" : "/-1",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 48.54,
    "medianResTime" : 45.0,
    "minResTime" : 22.0,
    "maxResTime" : 131.0,
    "pct1ResTime" : 75.9,
    "pct2ResTime" : 106.04999999999987,
    "pct3ResTime" : 131.0,
    "throughput" : 0.5101728465604147,
    "receivedKBytesPerSec" : 1.212656941921923,
    "sentKBytesPerSec" : 0.17537191600514254
  },
  "/notices-11" : {
    "transaction" : "/notices-11",
    "sampleCount" : 50,
    "errorCount" : 33,
    "errorPct" : 66.0,
    "meanResTime" : 279.56000000000006,
    "medianResTime" : 233.0,
    "minResTime" : 114.0,
    "maxResTime" : 501.0,
    "pct1ResTime" : 452.8,
    "pct2ResTime" : 493.79999999999995,
    "pct3ResTime" : 501.0,
    "throughput" : 0.5099907181689294,
    "receivedKBytesPerSec" : 3.744248260931651,
    "sentKBytesPerSec" : 0.19722297304189065
  },
  "/api/download/256-22" : {
    "transaction" : "/api/download/256-22",
    "sampleCount" : 50,
    "errorCount" : 9,
    "errorPct" : 18.0,
    "meanResTime" : 144.33999999999995,
    "medianResTime" : 72.5,
    "minResTime" : 39.0,
    "maxResTime" : 901.0,
    "pct1ResTime" : 408.6,
    "pct2ResTime" : 592.6499999999997,
    "pct3ResTime" : 901.0,
    "throughput" : 0.5123895800455002,
    "receivedKBytesPerSec" : 131.31133863699247,
    "sentKBytesPerSec" : 0.18414000532885164
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 250,
    "errorCount" : 86,
    "errorPct" : 34.4,
    "meanResTime" : 151.7640000000001,
    "medianResTime" : 78.5,
    "minResTime" : 5.0,
    "maxResTime" : 901.0,
    "pct1ResTime" : 367.8,
    "pct2ResTime" : 444.34999999999997,
    "pct3ResTime" : 594.9300000000005,
    "throughput" : 2.5388185354063633,
    "receivedKBytesPerSec" : 157.84657967193385,
    "sentKBytesPerSec" : 0.9684204296188725
  },
  "/courses-13" : {
    "transaction" : "/courses-13",
    "sampleCount" : 50,
    "errorCount" : 44,
    "errorPct" : 88.0,
    "meanResTime" : 276.17999999999995,
    "medianResTime" : 281.0,
    "minResTime" : 185.0,
    "maxResTime" : 424.0,
    "pct1ResTime" : 352.5,
    "pct2ResTime" : 386.84999999999985,
    "pct3ResTime" : 424.0,
    "throughput" : 0.5109078833086395,
    "receivedKBytesPerSec" : 22.156139037194094,
    "sentKBytesPerSec" : 0.20107019235681808
  },
  "/login-17" : {
    "transaction" : "/login-17",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.200000000000001,
    "medianResTime" : 8.0,
    "minResTime" : 5.0,
    "maxResTime" : 41.0,
    "pct1ResTime" : 17.9,
    "pct2ResTime" : 22.24999999999998,
    "pct3ResTime" : 41.0,
    "throughput" : 0.513015195510091,
    "receivedKBytesPerSec" : 0.7740317158819244,
    "sentKBytesPerSec" : 0.2174302684095503
  }
}