01_Offlines/Offline_4_Load_Testing_JMeter/JMeter-Practice/report2-v0/final_html_dashboard/statistics.json
{
  "/api/download/256" : {
    "transaction" : "/api/download/256",
    "sampleCount" : 50,
    "errorCount" : 33,
    "errorPct" : 66.0,
    "meanResTime" : 576.7799999999999,
    "medianResTime" : 306.5,
    "minResTime" : 60.0,
    "maxResTime" : 2834.0,
    "pct1ResTime" : 1341.0,
    "pct2ResTime" : 1555.6999999999994,
    "pct3ResTime" : 2834.0,
    "throughput" : 0.5174697797648617,
    "receivedKBytesPerSec" : 132.61325392112727,
    "sentKBytesPerSec" : 0.1859657021029972
  },
  "/login" : {
    "transaction" : "/login",
    "sampleCount" : 50,
    "errorCount" : 3,
    "errorPct" : 6.0,
    "meanResTime" : 67.59999999999998,
    "medianResTime" : 40.0,
    "minResTime" : 15.0,
    "maxResTime" : 617.0,
    "pct1ResTime" : 106.29999999999995,
    "pct2ResTime" : 328.64999999999907,
    "pct3ResTime" : 617.0,
    "throughput" : 0.5169080627319624,
    "receivedKBytesPerSec" : 0.7799052313680489,
    "sentKBytesPerSec" : 0.22109934714511678
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 250,
    "errorCount" : 134,
    "errorPct" : 53.6,
    "meanResTime" : 324.88000000000005,
    "medianResTime" : 225.0,
    "minResTime" : 15.0,
    "maxResTime" : 2834.0,
    "pct1ResTime" : 773.2000000000003,
    "pct2ResTime" : 1114.85,
    "pct3ResTime" : 1560.7400000000011,
    "throughput" : 2.5285472990057754,
    "receivedKBytesPerSec" : 157.20798360363506,
    "sentKBytesPerSec" : 0.9664779422176372
  },
  "/courses" : {
    "transaction" : "/courses",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 428.72,
    "medianResTime" : 360.5,
    "minResTime" : 210.0,
    "maxResTime" : 1241.0,
    "pct1ResTime" : 696.5999999999999,
    "pct2ResTime" : 1030.1499999999992,
    "pct3ResTime" : 1241.0,
    "throughput" : 0.5133944615005492,
    "receivedKBytesPerSec" : 22.263972511577045,
    "sentKBytesPerSec" : 0.20204879686007945
  },
  "/notices" : {
    "transaction" : "/notices",
    "sampleCount" : 50,
    "errorCount" : 43,
    "errorPct" : 86.0,
    "meanResTime" : 365.7000000000001,
    "medianResTime" : 383.5,
    "minResTime" : 127.0,
    "maxResTime" : 1106.0,
    "pct1ResTime" : 536.9,
    "pct2ResTime" : 601.65,
    "pct3ResTime" : 1106.0,
    "throughput" : 0.5092479426383117,
    "receivedKBytesPerSec" : 3.7387949538621363,
    "sentKBytesPerSec" : 0.19693572781715962
  },
  "/" : {
    "transaction" : "/",
    "sampleCount" : 50,
    "errorCount" : 5,
    "errorPct" : 10.0,
    "meanResTime" : 185.60000000000002,
    "medianResTime" : 95.0,
    "minResTime" : 40.0,
    "maxResTime" : 1309.0,
    "pct1ResTime" : 216.09999999999997,
    "pct2ResTime" : 1116.1999999999998,
    "pct3ResTime" : 1309.0,
    "throughput" : 0.5096424348676968,
    "receivedKBytesPerSec" : 1.211396178191381,
    "sentKBytesPerSec" : 0.17518958698577078
  }
}